In [1]:
import pandas as pd
df = pd.read_csv('data.csv')

In [5]:
df.describe()

                id    tax
count  1000.000000  654.0
mean    500.500000   20.0
std     288.819436    0.0
min       1.000000   20.0
25%     250.750000   20.0
50%     500.500000   20.0
75%     750.250000   20.0
max    1000.000000   20.0

In [4]:
df.price_paid.describe()

count      1000
unique      528
top       $3.73
freq          8
Name: price_paid, dtype: object

In [6]:
df.price_paid = df.price_paid.apply(lambda x: x.replace("$", ""))
df.price_paid = df.price_paid.astype(float)

In [7]:
df

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
0,1,03/28/2021,Marylin,Alders,malders0@shop-pro.jp,Male,160.119.8.119,Canada,5.36,NaN
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,8.32,NaN
2,3,03/17/2021,Erl,Kilminster,ekilminster2@etsy.com,Male,213.8.101.145,United States,3.73,20.0
3,4,03/19/2021,Grata,Brantl,gbrantl3@umn.edu,Female,5.140.237.101,United States,3.70,20.0
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,9.24,20.0
...,...,...,...,...,...,...,...,...,...,...
995,996,03/24/2021,Duff,Errigo,derrigorn@elpais.com,Female,193.84.247.144,France,3.63,NaN
996,997,03/17/2021,Ame,Rastall,arastallro@toplist.cz,Female,188.219.12.109,NaN,4.59,20.0
997,998,03/13/2021,Betty,Stickels,bstickelsrp@cloudflare.com,Male,199.80.60.87,United States,7.54,20.0
998,999,03/17/2021,Paquito,Tesoe,ptesoerq@rakuten.co.jp,Male,0.183.63.11,United States,5.81,NaN
999,1000,03/23/2021,Rochelle,Pringuer,rpringuerrr@house.gov,NaN,170.193.249.83,Canada,8.01,20.0

In [8]:
df.price_paid.mean()

6.461930000000001

In [12]:
df.price_paid.sum()

6461.93

In [18]:
df.gender.unique()

array(['Male', 'Female', nan], dtype=object)

In [22]:
df.country.value_counts()

France           408
United States    333
Canada           161
Morocco           54
Name: country, dtype: int64

In [31]:
df.gender.value_counts(normalize=True)

Female    0.529538
Male      0.470462
Name: gender, dtype: float64

In [34]:
df.groupby('country').mean()

                       id  price_paid   tax
country
Canada         437.049689    6.319565  20.0
France         525.588235    6.420613  20.0
Morocco        492.425926    6.721667  20.0
United States  504.954955    6.557568  20.0

In [36]:
df.groupby('gender')['price_paid'].sum()

gender
Female    3165.26
Male      2833.61
Name: price_paid, dtype: float64

In [43]:
df.groupby(['country','gender']).mean()

                              id  price_paid   tax
country       gender
Canada        Female  461.472973    6.419324  20.0
              Male    406.000000    6.117467  20.0
France        Female  512.648241    6.350352  20.0
              Male    534.928177    6.498950  20.0
Morocco       Female  479.925926    7.024815  20.0
              Male    483.652174    6.146957  20.0
United States Female  487.282353    6.437118  20.0
              Male    525.284722    6.672500  20.0